{
    "_comment": "SLaNg vocabulary token string to integer ID mapping. STRUCT:OPEN is assigned ID 23 (gap after operation tokens) because IDs 4-9 were already fully occupied when this omission was discovered. Renumbering existing IDs would break trained model weights. v1.2 added transcendental operation tokens OP:sin/cos/tan/exp/ln at IDs 24-28. EXP:2 at ID 85 must never be renamed or reused. EXP:25 added as a new token at ID 100 (not reusing 85). v1.3 adds OP:sec at ID 101 to support tan's derivative (sec^2), and slang_serializer.py's serialize_op_node() now supports two optional, backward-compatible decorator fields on any op-node: 'coeff' (emits an existing COEF: token, e.g. COEF:-1 for -sin(x)) and 'power' (emits an existing EXP: token, e.g. EXP:2 for sec^2(x)). Existing op-nodes (diff, integrate, etc.) never set these fields, so token output for them is completely unchanged -- this is purely additive.",
    "_version": "1.3",
    "special_tokens": {
        "[PAD]": 0,
        "[BOS]": 1,
        "[EOS]": 2,
        "[MASK]": 3
    },
    "structure_tokens": {
        "STRUCT:NUMI": 4,
        "STRUCT:DENO": 5,
        "STRUCT:SEP": 6,
        "STRUCT:CLOSE": 7,
        "NODE:FRAC": 8,
        "NODE:TERM": 9,
        "STRUCT:OPEN": 23
    },
    "operation_tokens": {
        "OP:diff": 10,
        "OP:integrate": 11,
        "OP:def_integrate": 12,
        "OP:gradient": 13,
        "OP:hessian": 14,
        "OP:lagrange": 15,
        "OP:product_rule": 16,
        "OP:quotient_rule": 17,
        "OP:chain_rule": 18,
        "OP:limit": 19,
        "OP:critical_pts": 20,
        "OP:dir_deriv": 21,
        "OP:taylor": 22,
        "OP:sin": 24,
        "OP:cos": 25,
        "OP:tan": 26,
        "OP:exp": 27,
        "OP:ln": 28,
        "OP:sec": 101
    },
    "opvar_tokens": {
        "OPVAR:x": 30,
        "OPVAR:y": 31,
        "OPVAR:z": 32,
        "OPVAR:t": 33,
        "OPVAR:r": 34,
        "OPVAR:xy": 35,
        "OPVAR:xyz": 36
    },
    "variable_tokens": {
        "VAR:x": 40,
        "VAR:y": 41,
        "VAR:z": 42,
        "VAR:t": 43,
        "VAR:r": 44,
        "VAR:w": 45,
        "VAR:v": 46,
        "VAR:u": 47,
        "VAR:c": 48
    },
    "coefficient_tokens": {
        "COEF:-10": 50,
        "COEF:-9": 51,
        "COEF:-8": 52,
        "COEF:-7": 53,
        "COEF:-6": 54,
        "COEF:-5": 55,
        "COEF:-4": 56,
        "COEF:-3": 57,
        "COEF:-2": 58,
        "COEF:-1": 59,
        "COEF:0": 60,
        "COEF:1": 61,
        "COEF:2": 62,
        "COEF:3": 63,
        "COEF:4": 64,
        "COEF:5": 65,
        "COEF:6": 66,
        "COEF:7": 67,
        "COEF:8": 68,
        "COEF:9": 69,
        "COEF:10": 70,
        "COEF:12": 71,
        "COEF:100": 72,
        "COEF:OTHER": 73
    },
    "exponent_tokens": {
        "EXP:-3": 80,
        "EXP:-2": 81,
        "EXP:-1": 82,
        "EXP:0": 83,
        "EXP:1": 84,
        "EXP:2": 85,
        "EXP:3": 86,
        "EXP:4": 87,
        "EXP:5": 88,
        "EXP:OTHER": 89,
        "EXP:25": 100
    },
    "rule_tokens": {
        "RULE:power_rule": 90,
        "RULE:chain_rule": 91,
        "RULE:product_rule": 92,
        "RULE:quotient_rule": 93,
        "RULE:sum_rule": 94,
        "RULE:constant_rule": 95,
        "RULE:power_rule_integral": 96,
        "RULE:partial_derivative": 97,
        "RULE:lagrange_multiplier": 98,
        "RULE:integration_by_parts": 99
    },
    "NODE:TERM": 10,
    "COEFF:*": 11,
    "VAR:*": 12,
    "STRUCT:*": 13,
    "STRUCT:OPEN": 14,
    "OP:DIFF": 15
}